# Missing Data
#### The NaN value in Pandas comes from numpy. NaN is not be equivalent to 0 or any empty string ' '.

In [1]:
# just import the numpy missing values

from numpy import NaN, NAN, nan

In [12]:
print(NaN == True)
print(NaN == False)
print(NaN == 0)
print(NaN == ' ')


# missing values are also not equal to other missing values

print(NaN == NaN)
print(NaN == nan)
print(NaN == NAN)
print(nan == NAN)

False
False
False
False
False
False
False
False

In [18]:
# pandas has built-in methods to test missing vlues

import pandas as pd

print(pd.isnull(NaN))
print(pd.isnull(nan))
print(pd.isnull(NAN))
print(pd.notnull(NaN))
print(pd.notnull(17))
print(pd.notnull('missing'))

True
True
True
False
True
True

In [22]:
# Set the location for data

visited_file = './survey_visited.csv'
print(pd.read_csv(visited_file))

   ident   site       dated
0    619   DR-1  1927-02-08
1    622   DR-1  1927-02-10
2    734   DR-3  1939-01-07
3    735   DR-3  1930-01-12
4    751   DR-3  1930-02-26
5    752   DR-3         NaN
6    837  MSK-4  1932-01-14
7    844   DR-1  1932-03-22

In [29]:
# load the data with defalut missing values

print(pd.read_csv(visited_file))

   ident   site       dated
0    619   DR-1  1927-02-08
1    622   DR-1  1927-02-10
2    734   DR-3  1939-01-07
3    735   DR-3  1930-01-12
4    751   DR-3  1930-02-26
5    752   DR-3         NaN
6    837  MSK-4  1932-01-14
7    844   DR-1  1932-03-22

In [23]:
# load the data without default missing values

print(pd.read_csv(visited_file, keep_default_na=False))

   ident   site       dated
0    619   DR-1  1927-02-08
1    622   DR-1  1927-02-10
2    734   DR-3  1939-01-07
3    735   DR-3  1930-01-12
4    751   DR-3  1930-02-26
5    752   DR-3
6    837  MSK-4  1932-01-14
7    844   DR-1  1932-03-22

In [31]:
# manually specify missing values

print(pd.read_csv(visited_file, na_values=[''], keep_default_na = False))

   ident   site       dated
0    619   DR-1  1927-02-08
1    622   DR-1  1927-02-10
2    734   DR-3  1939-01-07
3    735   DR-3  1930-01-12
4    751   DR-3  1930-02-26
5    752   DR-3         NaN
6    837  MSK-4  1932-01-14
7    844   DR-1  1932-03-22

## Merged Data

In [32]:
visited = pd.read_csv('./survey_visited.csv')
survey = pd.read_csv('./survey_survey.csv')

In [34]:
visited

   ident   site       dated
0    619   DR-1  1927-02-08
1    622   DR-1  1927-02-10
2    734   DR-3  1939-01-07
3    735   DR-3  1930-01-12
4    751   DR-3  1930-02-26
5    752   DR-3         NaN
6    837  MSK-4  1932-01-14
7    844   DR-1  1932-03-22

In [35]:
survey

    taken person quant  reading
0     619   dyer   rad     9.82
1     619   dyer   sal     0.13
2     622   dyer   rad     7.80
3     622   dyer   sal     0.09
4     734     pb   rad     8.41
5     734   lake   sal     0.05
6     734     pb  temp   -21.50
7     735     pb   rad     7.22
8     735    NaN   sal     0.06
9     735    NaN  temp   -26.00
10    751     pb   rad     4.35
11    751     pb  temp   -18.50
12    751   lake   sal     0.10
13    752   lake   rad     2.19
14    752   lake   sal     0.09
15    752   lake  temp   -16.00
16    752    roe   sal    41.60
17    837   lake   rad     1.46
18    837   lake   sal     0.21
19    837    roe   sal    22.50
20    844    roe   rad    11.25

In [36]:
vs = visited.merge(survey, left_on = 'ident', right_on = 'taken')
vs

    ident   site       dated  taken person quant  reading
0     619   DR-1  1927-02-08    619   dyer   rad     9.82
1     619   DR-1  1927-02-08    619   dyer   sal     0.13
2     622   DR-1  1927-02-10    622   dyer   rad     7.80
3     622   DR-1  1927-02-10    622   dyer   sal     0.09
4     734   DR-3  1939-01-07    734     pb   rad     8.41
5     734   DR-3  1939-01-07    734   lake   sal     0.05
6     734   DR-3  1939-01-07    734     pb  temp   -21.50
7     735   DR-3  1930-01-12    735     pb   rad     7.22
8     735   DR-3  1930-01-12    735    NaN   sal     0.06
9     735   DR-3  1930-01-12    735    NaN  temp   -26.00
10    751   DR-3  1930-02-26    751     pb   rad     4.35
11    751   DR-3  1930-02-26    751     pb  temp   -18.50
12    751   DR-3  1930-02-26    751   lake   sal     0.10
13    752   DR-3         NaN    752   lake   rad     2.19
14    752   DR-3         NaN    752   lake   sal     0.09
15    752   DR-3         NaN    752   lake  temp   -16.00
16    752   DR-3         NaN    752    roe   sal    41.60
17    837  MSK-4  1932-01-14    837   lake   rad     1.46
18    837  MSK-4  1932-01-14    837   lake   sal     0.21
19    837  MSK-4  1932-01-14    837    roe   sal    22.50
20    844   DR-1  1932-03-22    844    roe   rad    11.25

## User Input Values

In [38]:
# missing value in a series

num_legs = pd.Series({'goat': 4, 'amoeba': nan})
num_legs

goat      4.0
amoeba    NaN
dtype: float64

In [39]:
# missing value in dataframe

scientists = pd.DataFrame({
    'Name': ['Rosaline Franklin', 'William Gosset'],
    'Occupation': ['Chemist', 'Statistician'],
    'Born': ['1920-07-25', '1876-06-13'],
    'Died': ['1958-4-16', '1937-10-16'],
    'Missing': [NaN, nan]})

print(scientists)

                Name    Occupation        Born        Died  Missing
0  Rosaline Franklin       Chemist  1920-07-25   1958-4-16      NaN
1     William Gosset  Statistician  1876-06-13  1937-10-16      NaN

In [42]:
# create a new dataframe

scientists = pd.DataFrame({
    'Name' : ['Rosaline Fraklin', 'William Gosset'],
    'Occupation' : ['Chemist', 'Statistician'],
    'Born' : ['1920-07-25', '1876-06-13'],
    'Died' : ['1958-04-16', '1937-10-16']})
scientists

               Name    Occupation        Born        Died
0  Rosaline Fraklin       Chemist  1920-07-25  1958-04-16
1    William Gosset  Statistician  1876-06-13  1937-10-16

In [54]:
# Assign a colum of missing values
scientists['missing'] = nan
scientists

,Name,Occupation,Born,Died,missing,not_missing
0,Rosaline Fraklin,Chemist,1920-07-25,1958-04-16,NaN,NaN
1,William Gosset,Statistician,1876-06-13,1937-10-16,NaN,NaN

## Re-indexing

In [55]:
gapminder = pd.read_csv('./gapminder.tsv', sep = '\t')

In [57]:
life_exp = gapminder.groupby(['year'])['lifeExp'].mean()
life_exp

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [63]:
# you can continue to chain the 'loc' from the code above

from ipykernel import kernelapp as app
print(life_exp.loc[range(2000, 2010), ])

year
2000          NaN
2001          NaN
2002    65.694923
2003          NaN
2004          NaN
2005          NaN
2006          NaN
2007    67.007423
2008          NaN
2009          NaN
Name: lifeExp, dtype: float64

/anaconda3/lib/python3.6/site-packages/ipykernel/__main__.py:4: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike

In [64]:
# alternativly, you can subset the data separately and use the reindex method

#subset
y2000 = life_exp[life_exp.index > 2000]
y2000

year
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [65]:
# reindex
print(y2000.reindex(range(2000, 2010)))

year
2000          NaN
2001          NaN
2002    65.694923
2003          NaN
2004          NaN
2005          NaN
2006          NaN
2007    67.007423
2008          NaN
2009          NaN
Name: lifeExp, dtype: float64

## Find and Count Missing Data

In [66]:
ebola = pd.read_csv('./country_timeseries.csv')

In [67]:
# count the number of non-missing values

print(ebola.count())

Date                   122
Day                    122
Cases_Guinea            93
Cases_Liberia           83
Cases_SierraLeone       87
Cases_Nigeria           38
Cases_Senegal           25
Cases_UnitedStates      18
Cases_Spain             16
Cases_Mali              12
Deaths_Guinea           92
Deaths_Liberia          81
Deaths_SierraLeone      87
Deaths_Nigeria          38
Deaths_Senegal          22
Deaths_UnitedStates     18
Deaths_Spain            16
Deaths_Mali             12
dtype: int64

In [69]:
num_rows = ebola.shape[0]
num_missing = num_rows - ebola.count()

In [70]:
num_rows

122

In [71]:
num_missing

Date                     0
Day                      0
Cases_Guinea            29
Cases_Liberia           39
Cases_SierraLeone       35
Cases_Nigeria           84
Cases_Senegal           97
Cases_UnitedStates     104
Cases_Spain            106
Cases_Mali             110
Deaths_Guinea           30
Deaths_Liberia          41
Deaths_SierraLeone      35
Deaths_Nigeria          84
Deaths_Senegal         100
Deaths_UnitedStates    104
Deaths_Spain           106
Deaths_Mali            110
dtype: int64

## Counting missing values in particular column

In [72]:
# to count the total number of missing balues in data or count the number of missing values for particular column
#  you can use count_nonzero function from numpy with isnull method

import numpy as np
print(np.count_nonzero(ebola.isnull()))

1214

In [73]:
print(np.count_nonzero(ebola['Cases_Guinea'].isnull()))

29

In [74]:
# get the first 5 counts from the Cases_Guinea column 
# you can get the a missing value counts by using dropna parameter

print(ebola.Cases_Guinea.value_counts(dropna=False).head())

NaN       29
 86.0      3
 495.0     2
 112.0     2
 390.0     2
Name: Cases_Guinea, dtype: int64

## Cleaning Missing Data

In [78]:
# you can use fillna method to record the missing value to another value. Here (0)is used. 

print(ebola.fillna('0').iloc[0:10, 0:5])

         Date  Day Cases_Guinea Cases_Liberia Cases_SierraLeone
0    1/5/2015  289         2776             0             10030
1    1/4/2015  288         2775             0              9780
2    1/3/2015  287         2769          8166              9722
3    1/2/2015  286            0          8157                 0
4  12/31/2014  284         2730          8115              9633
5  12/28/2014  281         2706          8018              9446
6  12/27/2014  280         2695             0              9409
7  12/24/2014  277         2630          7977              9203
8  12/21/2014  273         2597             0              9004
9  12/20/2014  272         2571          7862              8939

## Fill Data Forward

In [87]:
# in this way, missing values are replaced with the last known/recorded value. 

print(ebola.fillna(method='ffill').iloc[0:10, 0:5])

         Date  Day  Cases_Guinea  Cases_Liberia  Cases_SierraLeone
0    1/5/2015  289        2776.0            NaN            10030.0
1    1/4/2015  288        2775.0            NaN             9780.0
2    1/3/2015  287        2769.0         8166.0             9722.0
3    1/2/2015  286        2769.0         8157.0             9722.0
4  12/31/2014  284        2730.0         8115.0             9633.0
5  12/28/2014  281        2706.0         8018.0             9446.0
6  12/27/2014  280        2695.0         8018.0             9409.0
7  12/24/2014  277        2630.0         7977.0             9203.0
8  12/21/2014  273        2597.0         7977.0             9004.0
9  12/20/2014  272        2571.0         7862.0             8939.0

## Fill Data Backward

In [86]:
# if column ends with a missing value, then it will remain missing because there is no new value to fill in.

print(ebola.fillna(method='bfill').iloc[:, 0:5].tail())

          Date  Day  Cases_Guinea  Cases_Liberia  Cases_SierraLeone
117  3/27/2014    5         103.0            8.0                6.0
118  3/26/2014    4          86.0            NaN                NaN
119  3/25/2014    3          86.0            NaN                NaN
120  3/24/2014    2          86.0            NaN                NaN
121  3/22/2014    0          49.0            NaN                NaN

## Interpolate

In [88]:
# interpolation uses existing value to fill in missing value.  
# in pandas the interpolation fills in missing values linearly. 

print(ebola.interpolate().iloc[0:10, 0:5])

         Date  Day  Cases_Guinea  Cases_Liberia  Cases_SierraLeone
0    1/5/2015  289        2776.0            NaN            10030.0
1    1/4/2015  288        2775.0            NaN             9780.0
2    1/3/2015  287        2769.0         8166.0             9722.0
3    1/2/2015  286        2749.5         8157.0             9677.5
4  12/31/2014  284        2730.0         8115.0             9633.0
5  12/28/2014  281        2706.0         8018.0             9446.0
6  12/27/2014  280        2695.0         7997.5             9409.0
7  12/24/2014  277        2630.0         7977.0             9203.0
8  12/21/2014  273        2597.0         7919.5             9004.0
9  12/20/2014  272        2571.0         7862.0             8939.0

## Drop Missing values

In [89]:
# to drop observations or variables with missing data
# thresh parameter lets you specify how many non_NaN values you have before dropping the row and column

print(ebola.shape)

(122, 18)

In [93]:
ebola_dropna = ebola.dropna()
print(ebola_dropna.shape)

(1, 18)

In [94]:
# if you keep only compelte cases in this data set you are left with just one row
ebola_dropna

,Date,Day,Cases_Guinea,Cases_Liberia,Cases_SierraLeone,Cases_Nigeria,Cases_Senegal,Cases_UnitedStates,Cases_Spain,Cases_Mali,Deaths_Guinea,Deaths_Liberia,Deaths_SierraLeone,Deaths_Nigeria,Deaths_Senegal,Deaths_UnitedStates,Deaths_Spain,Deaths_Mali
19,11/18/2014,241,2047.0,7082.0,6190.0,20.0,1.0,4.0,1.0,6.0,1214.0,2963.0,1267.0,8.0,0.0,1.0,0.0,6.0

## Calculations with Missing Data

In [96]:
ebola['Cases_multiple'] = ebola['Cases_Guinea'] + \
                         ebola['Cases_Liberia'] + \
                         ebola['Cases_SierraLeone']

In [99]:
ebola['Cases_multiple'].head(10)

0        NaN
1        NaN
2    20657.0
3        NaN
4    20478.0
5    20170.0
6        NaN
7    19810.0
8        NaN
9    19372.0
Name: Cases_multiple, dtype: float64

In [108]:
# Calculations with missing values  return a missing value.
# Unless the function or method called has a means to ignore missing value by skpping over the missing values.

ebola_subset = ebola.loc[:, ['Cases_Guinea', 'Cases_Liberia', 'Cases_SierraLeone', 'Cases_multiple']]
print(ebola_subset.head(n=10))

   Cases_Guinea  Cases_Liberia  Cases_SierraLeone  Cases_multiple
0        2776.0            NaN            10030.0             NaN
1        2775.0            NaN             9780.0             NaN
2        2769.0         8166.0             9722.0         20657.0
3           NaN         8157.0                NaN             NaN
4        2730.0         8115.0             9633.0         20478.0
5        2706.0         8018.0             9446.0         20170.0
6        2695.0            NaN             9409.0             NaN
7        2630.0         7977.0             9203.0         19810.0
8        2597.0            NaN             9004.0             NaN
9        2571.0         7862.0             8939.0         19372.0

In [102]:
# Skipping missing values is True by defalut

print(ebola.Cases_Guinea.sum(skipna = True))

84729.0

In [107]:
print(ebola.Cases_Guinea.sum(skipna = False))

nan